БИТУправление_медицинским_центром_демо/src/DataProcessors/ОбъединениеДублирующихсяКлиентов/ОбъединениеДублирующихсяКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбъединениеДублирующихсяКлиентов</name>
  <attributes>
    <name>НайденныеСсылки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОбъединениеДублирующихсяПациентов/ОбъединениеДублирующихсяПациентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъединениеДублирующихсяПациентов</name>
  <dimensions>
    <name>ПравильныйПациент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФИОПравильного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ФИОНеправильного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/DataProcessors/ОбъединениеДублирующихсяКлиентов/Forms/Форма/Module.bsl
#Область РазделОписанияПеременных

Перем НайденныеСсылки;
Перем ФормаПрогресс;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отступ = " - ";
	
	ТекстЗаголовка = "Реквизиты, на которые вляет установленный приоритет:";
	МетаданныеКлиенты = Метаданные.Справочники.Клиенты;
	Если Метаданные.РегистрыСведений.Найти("КонтактнаяИнформация") <> Неопределено Тогда
		ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + Отступ + "Контактная информация";
	КонецЕсли;
	Если МетаданныеКлиенты.Реквизиты.Найти("Комментарий") <> Неопределено Тогда
		ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + Отступ + "Комментарий клиента";
	КонецЕсли;
	Если МетаданныеКлиенты.Реквизиты.Найти("ЗаконныйПредставитель") <> Неопределено Тогда
		ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + Отступ + "Законный представитель клиента";
	КонецЕсли;
	Если МетаданныеКлиенты.Реквизиты.Найти("ЦехУчасток") <> Неопределено
		И МетаданныеКлиенты.Реквизиты.Найти("ДатаОтсчетаСтажа") <> Неопределено
		И ОбщегоНазначения.ПодсистемаСуществует("Медицина.МедицинскиеОсмотры")
	Тогда
		ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + Отступ + "Медосмотры";		
	КонецЕсли;
	Если Метаданные.Справочники.Найти("ПереченьВредныхФакторовИРабот") <> Неопределено Тогда
		ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + Отступ + "Вредные факторы клиента";
	КонецЕсли;
		
	Элементы.ИнформацияОбОбъединении.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыполнитьНажатие(Команда)
	
	ОбозначениеКлиентовРП = "пациентов";
	Ответ=Вопрос("Объединить данные " + ОбозначениеКлиентовРП + " " + НаЧтоЗаменять + " и " + ЧтоЗаменять + "?",РежимДиалогаВопрос.ДаНет,0);
	Если Ответ=КодВозвратаДиалога.Да Тогда
		бит_ПолныеПрава.ОбъединитьДвухПациентов(НаЧтоЗаменять, ЧтоЗаменять, ДанныеДубляБолееАктуальны);
		ЗаписатьЛогОбъединения(НаЧтоЗаменять, ЧтоЗаменять);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объединение данных " + ОбозначениеКлиентовРП + " завершено.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоОбъединениям(Команда)
	
	ОткрытьФорму("Отчет.ОбъединениеДублирующихсяПациентов.Форма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьЛогОбъединения(Правильный, Неправильный)
	
	НоваяЗапись = РегистрыСведений.ОбъединениеДублирующихсяПациентов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ДатаОперации = ТекущаяДата();
	НоваяЗапись.ПравильныйПациент = Правильный;
	НоваяЗапись.ФИОПравильного	 = СокрЛП(Правильный.Фамилия)	+ " " + СокрЛП(Правильный.Имя)	 + " " + СокрЛП(Правильный.Отчество);
	НоваяЗапись.ФИОНеправильного = СокрЛП(Неправильный.Фамилия) + " " + СокрЛП(Неправильный.Имя) + " " + СокрЛП(Неправильный.Отчество);
	НоваяЗапись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	НоваяЗапись.Записать();
	
КонецПроцедуры

#КонецОбласти
